Autodesk.Revit.DB.ScheduleDefinition.CanFilterByValuePresence(Autodesk.Revit.DB.ScheduleFieldId)
Checks whether a field can be used with a value presence-based filter.
Remarks:
The value presence filter types are HasValue and HasNoValue.
fieldId:
The ID of the field to check.
Returns:
True if the field can be used with a value presence filter, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldId is not the ID of a field in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020